app/Models/ProdutoMOD.php

    public function allProdutos($id = null){
        if($id === null){
            return $this->findAll();
---
SELECT *
FROM `produtomods`

    public function addProdutos($data){
        return $this->insert($data);
---
INSERT INTO `produtomods` (`descricao`, `custo`, `precovenda`, `qtd`, `estoque`) VALUES ('Banana Pão', '1200', '1500', '100', '100')

    public function updateProdutos($id, $data){
        if($data !== null){
            return $this->where('id', $id)->set($data)->update();
---
UPDATE `produtomods` SET `descricao` = 'Banana Pão', `custo` = '1200', `precovenda` = '1500.05', `qtd` = '100', `estoque` = '100'
WHERE `id` = '19'

    public function deleteProdutos($id){
        $this->where('id', $id)->delete();
---
DELETE FROM `produtomods`
WHERE `id` = '19'